<h1 style='text-align: center;'>
 EXCERCISE ON NUMERICAL FUNCTIONS </h1>

In [21]:
# Load and activate SQL extension

%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [22]:
# Connect to the united nations database on mysql
%sql mysql+pymysql://root:Cedrick254@localhost:3306/united_nations

In [23]:
%%sql

SHOW TABLES;

 * mysql+pymysql://root:***@localhost:3306/united_nations
2 rows affected.

[('access_to_basic_services',), ('estimates_water',)]

In [24]:
%%sql

SELECT *
FROM access_to_basic_services
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/united_nations
10 rows affected.

[('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2015, 94.67, 98, 17.542806, 184.39, 2699700, 4.93),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2016, 94.67, 98, 17.794055, 137.28, 2699700, 4.96),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2017, 95.0, 98, 18.037776, 166.81, 2699700, 4.9),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2018, 95.0, 98, 18.276452, 179.34, 2699700, 4.85),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2019, 95.0, 98, 18.513673, 181.67, 2699700, 4.8),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2020, 95.0, 98, 18.755666, 171.08, 2699700, 4.89),
 ('Central and Southern Asia', 'Central Asia', 'Kyrgyzstan', 2015, 89.67, 97, None, None, None, None),
 ('Central and Southern Asia', 'Central Asia', 'Kyrgyzstan', 2016, 90.33, 97, None, None, None, None),
 ('Central and Southern Asia', 'Central Asia', 'Kyrgyzstan', 2017, 91.0, 97, None, None, None, None),
 ('Central and Southern Asia', 'Central Asia', 'Kyrgyzstan', 2018, 91.33, 97, None, None, None, None)]

### 1. What is the total number of entries in the dataset?

Count the number of entries in the dataset using the COUNT function. Return the result with an alias.

In [25]:
%%sql

SELECT COUNT(*) AS Number_of_Entries
FROM access_to_basic_services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(1048,)]

### 2. What are the earliest and latest years for which we have data?
Determine the earliest and latest years by calculating the minimum and maximum of the Time_period column using the MIN and MAX functions respectively. Use aliases to name the results.

In [28]:
%%sql

SELECT MIN(Time_Period) AS Earliest_Year, MAX(Time_Period) AS Latest_Year
FROM access_to_basic_services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(2015, 2020)]

### 3. How many countries are included in this dataset?
Count the number of countries in the Country_name column. Note, if we only use the COUNT function without an additional keyword, SQL will return the total number of entries in the column, including duplicates. Use the DISTINCT keyword to only return unique country names. Return the result with an alias.

In [29]:
%%sql

SELECT COUNT(DISTINCT Country_name)
FROM access_to_basic_services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(182,)]

### 4. What is the average percentage of people who have access to managed drinking water services across all years and all countries included in our dataset?
Use the AVG function to calculate the average of the Pct_managed_drinking_water_services column. Use an alias.

In [32]:
%%sql

SELECT AVG(Pct_managed_drinking_water_services) AS Average_Managed_Drinking_Water_Services
FROM access_to_basic_services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(87.18910305343516,)]